In [2]:
import numpy as np
import pandas as pd

## Series

In [4]:
#创建一个series，索引为默认值
s1 = pd.Series([4,7,-5,3])
print(s1)

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
s1.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
s1.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
#指定索引
s2 = pd.Series([4.0,7,-5,3], index=['a','b','c','d'])
print(s2)

a    4.0
b    7.0
c   -5.0
d    3.0
dtype: float64

In [10]:
s2['c']

-5.0

In [13]:
s2[['a','b']]

a    4.0
b    7.0
dtype: float64

In [14]:
'b' in s2

True

In [15]:
'e' in s2

False

注：Series可以看成一个定长的有序字典

In [17]:
dic1 = {'apple':5,'pen':3,'applepen':10}
s3 = pd.Series(dic1)
print(s3)

apple        5
pen          3
applepen    10
dtype: int64

## DataFrame

In [19]:
data={'year':[2014,2015,2016,2017],
     'income':[1,2,5,8],
      'pay':[5,2,3,3]}
df1 = pd.DataFrame(data)
df1

   year  income  pay
0  2014       1    5
1  2015       2    2
2  2016       5    3
3  2017       8    3

In [20]:
df2 = pd.DataFrame(np.arange(12).reshape(3,4))
df2

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [33]:
#指定表头和索引
df3 = pd.DataFrame(np.arange(12).reshape(3,4),
                  index=['a','c','b'],
                  columns=['w','y','x','z'])
df3

   w  y   x   z
a  0  1   2   3
c  4  5   6   7
b  8  9  10  11

In [23]:
df1.columns

Index(['year', 'income', 'pay'], dtype='object')

In [26]:
df1.index

RangeIndex(start=0, stop=4, step=1)

In [27]:
df1.values

array([[2014,    1,    5],
       [2015,    2,    2],
       [2016,    5,    3],
       [2017,    8,    3]], dtype=int64)

In [28]:
df1.describe()

              year    income       pay
count     4.000000  4.000000  4.000000
mean   2015.500000  4.000000  3.250000
std       1.290994  3.162278  1.258306
min    2014.000000  1.000000  2.000000
25%    2014.750000  1.750000  2.750000
50%    2015.500000  3.500000  3.000000
75%    2016.250000  5.750000  3.500000
max    2017.000000  8.000000  5.000000

In [29]:
df1.T

           0     1     2     3
year    2014  2015  2016  2017
income     1     2     5     8
pay        5     2     3     3

In [34]:
#排序
df3

   w  y   x   z
a  0  1   2   3
c  4  5   6   7
b  8  9  10  11

In [35]:
df3.sort_index(axis=1)

   w   x  y   z
a  0   2  1   3
c  4   6  5   7
b  8  10  9  11

In [36]:
df3.sort_index(axis=0)

   w  y   x   z
a  0  1   2   3
b  8  9  10  11
c  4  5   6   7

In [37]:
df3.sort_values(by='x')

   w  y   x   z
a  0  1   2   3
c  4  5   6   7
b  8  9  10  11